<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use App\Models\Question;

class QuestionSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        // $chapter_ids = [1,1,1,4];
        $question_text = ['التعامل مع المخالفين' , 'دلائل أصول الإسلام' , 'بوصلة المصلح' , 'مصادر التلقي والمعرفة' , 
                          'كيف تخرج من المنزل' , 'كيف تتعامل مع غروبك' , 'كيف تتعامل مع الللابتوب' , 'كيف تختفي' ,
                          'كيف تتعيش' , 'كيف تحكي' , 'كيف تتعامل مع البشر' , 'كيف تطير' , 'كيف تقرأ' , 'شو اطيب فاكهة' ,
                          'شو عم تعمل اليوم' , 'شو عملت مبارح' , 'شو بدك تعمل بكرا' , 'شو بدك تعمل بعد شهر' , 'شو مخططاتك للصيف' ,
                          'وين ملاقي حالك بعد خمس سنين'];
        $difficulty_score = [110,145,180,220,265,310,355,390,430,470,510,550,590,625,660,710,760,810,860,895];
        $explanation = ['التعامل مع المخالفين' , 'دلائل أصول الإسلام' , 'بوصلة المصلح' , 'مصادر التلقي والمعرفة' , 
                          'كيف تخرج من المنزل' , 'كيف تتعامل مع غروبك' , 'كيف تتعامل مع الللابتوب' , 'كيف تختفي' ,
                          'كيف تتعيش' , 'كيف تحكي' , 'كيف تتعامل مع البشر' , 'كيف تطير' , 'كيف تقرأ' , 'شو اطيب فاكهة' ,
                          'شو عم تعمل اليوم' , 'شو عملت مبارح' , 'شو بدك تعمل بكرا' , 'شو بدك تعمل بعد شهر' , 'شو مخططاتك للصيف' ,
                          'وين ملاقي حالك بعد خمس سنين'];
        for ($i=0; $i < 20 ; $i++) {
            Question::query()->create([
           'chapter_id'=> 1,
           'question_text' => $question_text[$i],
           'explanation' => $explanation[$i],
           'difficulty_score' => $difficulty_score[$i]
            ]); }
    }
}
